Autodesk.Revit.Exceptions.DisabledDisciplineException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.DisabledDisciplineException
The exception that is thrown when the function cannot execute because
a discipline is disabled. The exception specifies which discipline(s) would let
the operation succeed.